Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//Вставить содержимое обработчика.
	Номер = Серверный.ПолучитьНомер(Дата);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Оценки
	Движения.Оценки.Записывать = Истина;
	Для Каждого ТекСтрокаУроки Из Уроки Цикл
		Движение = Движения.Оценки.Добавить();
		Движение.Период = Дата;
		Движение.Предмет = ТекСтрокаУроки.Предмет;
		Движение.НомерУрока = ТекСтрокаУроки.НомерСтроки;
		Движение.Оценка = ТекСтрокаУроки.Оценка;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
